Revit 2024 API
BarTypeDiameterOptions.BarModelDiameter Property
 Represents the bar model diameter of the RebarBarType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public double BarModelDiameter { get; set; }
Visual Basic
Public Property BarModelDiameter As Double
	Get
	Set
Visual C++
public:
property double BarModelDiameter {
	double get ();
	void set (double value);
}
See Also
BarTypeDiameterOptions Class
Autodesk.Revit.DB Namespace